compressible/rhoPimpleFoam/LES/forcedPlume/run/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "myDict"

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;
//stopAt          writeNow;

endTime        $myEndTime; // 0.01;

deltaT          1e-09;

writeControl    adjustableRunTime;

writeInterval    $myWriteInterval; // 0.0001;

purgeWrite      0;

writeFormat     binary;

writePrecision  16;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.2;

functions
{
    #include "cuttingPlane.H"
    #include "averaging.H"
    #include "sampleDict"
}

// ************************************************************************* //
