compressible/rhoPimpleFoam/LES/forcedPlume/run/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type        fixedValue;
	value       uniform 101325;
    }
    wall
    {
        type        zeroGradient;
    }
    vertical
    {
        type            totalPressure;
	U		U;
	p0	        $internalField;
	rho		rho;
        phi             phi;
	psi		none;
	gamma		1.4;
    }

    top
    {
        type            totalPressure;
        U               U;
        p0              $internalField;
        rho             rho;
        phi             phi;
        psi             none;
        gamma           1.4;
    }
}


// ************************************************************************* //
