compressible/rhoPimpleFoam/LES/forcedPlume/run/system/myDictDebug

myNCores 4; 

jetDiameter 0.0635; // 0.0635;

myResolution1 2;    // cells in the diameter 

lx 9.5; // 5.5  // domain width in diameters

lz 10.0; // 18.0 // domain height in diameters

myEndTime 0.001; // 0.002;

myWriteInterval 0.001; 

probeDistanceZ1_D 2.0;  // height in diamters 
probeDistanceZ2_D 4.0;  // height in diamters 
probeDistanceX_D  5.0;  // horizontal distance (acoustic probes)

